[
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BOTA2MDVhMWItNTYwYi00OTcyLWJjZmEtNTQ2NTAxMDQyYTQwXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 7.9,
        "released": 2021,
        "genre": ["Drama", "Sci-fi", "Action", "Romance"],
        "type": "show",
        "imdbid": "tt11192306",
        "title": "Superman and Lois", 
        "synopsis": "Superman & Lois stars Tyler Hoechlin (Teen Wolf) and Elizabeth Tulloch (Grimm) as the world's most famous superhero and comic books' most famous journalist as they deal with all the stress, pressures and complexities that come with being working parents in today's society."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BMTRjZjc2YjMtNmI0Ny00NjUwLWEzNTctZjhkZmZjMWEyOTBmXkEyXkFqcGdeQXVyOTQyMzUzMzk@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 9.1,
        "released": 2021,
        "genre": ["Crime"],
        "type": "show",
        "imdbid": "tt11595618",
        "title": "American Detective", 
        "synopsis": "American Detective with Joe Kenda: Lt. Joe Kenda, one of the toughest, most experienced homicide detectives in ID history, is back exclusively on discovery plus with an all new series. Over the years, Kenda has heard about cases that defy logic and investigations so confounding that they feel more scripted in Hollywood than reality. In American Detective, Kenda trades in his own case files to bring viewers astounding investigations from across the country, with each episode featuring a different homicide detective whose tireless efforts helped put a killer behind bars and bring justice for the victim."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BZDRmNjVmODUtZjc0Zi00YTVkLWJhZjYtNjRjYmJiMjU4ODJkXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 5.9,
        "released": 2021,
        "genre": ["Fantasy", "Crime", "Drama", "Mystry"],
        "type": "show",
        "imdbid": "tt10893694",
        "title": "The Irregulars", 
        "synopsis": "Set in Victorian London, the series follows a gang of troubled street teens who are manipulated into solving crimes for the sinister Doctor Watson and his mysterious business partner, the elusive Sherlock Holmes."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BZTQ1NWFkYzEtNTViNy00NDNlLWI1ZTQtOTNlYjkyZjhjNDE4XkEyXkFqcGdeQXVyMTA3OTA3NTYz._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 6.7,
        "genre": ["Documentry"],
        "type": "show",
        "released": 2021,
        "imdbid": "tt13789092",
        "title": "Spycraft", 
        "synopsis": "Non fiction series about the tools of the trade. Based upon the book by Henry R. Schlesinger."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BMjFhNmI3ZjQtOTg2OC00N2VmLWEwNDgtYjE1ZTUwNjhiY2VkXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 7.5,
        "genre": ["Drama", "Romance"],
        "type": "show",
        "released": 2021,
        "imdbid": "tt9012876",
        "title": "Firefly Lane", 
        "synopsis": "The story of Tully and Kate, two unlikely friends, from their meeting as tweens in 1974 to the present. Kate, the introvert, and Tully, the coolest girl in school, form a bond that weathers every milestone in their lives, leading up to a tragedy in the present."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BNmNkOTE2NTAtMDYxZi00NjViLWE1NWItMTA3YTI3YzlkMDIyXkEyXkFqcGdeQXVyNDk3ODk4OQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 7.3,
        "genre": ["Comedy", "Drama", "Fantasy", "Family"],
        "type": "show",
        "released": 2020,
        "imdbid": "tt11569530",
        "title": "Just Add Magic: Mystery City", 
        "synopsis": "In this spinoff of the successful series JUST ADD MAGIC, we follow the magic cookbook to Bay City as it moves to three new protectors: step-siblings Zoe and Leo, and their upstairs neighbor Ish. Each of the three brings a unique skill to the table, as the cookbook unlocks a centuries-old mystery that takes them on an historical adventure through the city streets in a race to find a secret recipe."
    },
    {
        
        "imageurl": "https://m.media-amazon.com/images/M/MV5BYWUzMGZjNjgtMzkwYS00MTdhLTlhYzItYTEzMjRjMjkzZmM3XkEyXkFqcGdeQXVyMTE5MzYzMDE5._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 7.6,
        "genre": ["Thriller", "Drama", "Fantasy", "Sci-fi"],
        "type": "show",
        "released": 2020,
        "imdbid": "tt9170108",
        "title": "Raised by Wolves", 
        "synopsis": "After Earth is torn apart by religious differences and the human race teeters on the edge of extinction, an atheistic android architect sends two creations - Mother and Father - to start a peaceful, godless colony on the planet Kepler-22b. From executive producer Ridley Scott, Raised by Wolves follows Mother and Father as they attempt to raise human children in this mysterious virgin land - a treacherous and difficult task that's jeopardized by the arrival of the Mithraic, a deeply devout religious order of surviving humans. As the androids make contact with this zealous and dangerous people, they struggle to control the beliefs of their fiercely self-determining children."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BN2U2YTFjMjUtZGRlYS00Y2ViLThiZDAtYzJmZmE4MTcyODc2XkEyXkFqcGdeQXVyNzMwODg0MzM@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 9.5,
        "genre": ["Fantasy","Drama", "Sci-fi", "Horror"],
        "type": "show",
        "released": 2020,
        "imdbid": "tt12326830",
        "title": "The Sandman", 
        "synopsis": "When The Sandman, also known as Lord Morpheus - the immortal king of dreams, stories and the imagination - is pulled from his realm and imprisoned on Earth by a nefarious cult, he languishes for decades before finally escaping. Once free, he must retrieve the three 'tools' that will restore his power and help him to rebuild his dominion, which has deteriorated in his absence. As the multi-threaded story unspools, The Sandman descends into Hell to confront Lucifer (Michael Sheen), chases rogue nightmares who have escaped his realm, and crosses paths with an array of characters from DC comic books, ancient myths, and real-world history, including: Inmates of Gotham City's Arkham Asylum, Doctor Destiny, the muse Calliope, the three Fates, William Shakespeare (Arthur Darvill), and many more."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BOTg3YjU0NGUtMTFhYi00OWMwLThmOGYtYTg5MDJhMTdmMWIwXkEyXkFqcGdeQXVyNjEwNTM2Mzc@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 7.7,
        "genre": ["Crime", "Drama", "Comedy"],
        "type": "show",
        "released": 2020,
        "imdbid": "tt10584608",
        "title": "Teenage Bounty Hunters", 
        "synopsis": "After joining forces with a veteran bounty hunter, sixteen-year-old fraternal twin sisters Sterling and Blair dive into the world of bail skipping baddies while still navigating the high stakes of teenage life."
    },
    {
        "imageurl": "https://m.media-amazon.com/images/M/MV5BMmI0Mjc4ZTgtZmU0My00ODliLWE0MzYtYzBiODMxZWJkZmE4XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
        "imdbrating": 8.1,
        "genre": ["Drama"],
        "type": "show",
        "released": 2020,
        "imdbid": "tt11204260",
        "title": "I May Destroy You", 
        "synopsis": "The question of sexual consent in contemporary life and how, in the new landscape of dating and relationships, we make the distinction between liberation and exploitation."
    }
]